; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=264, out_folder=./training, instance_id=48, seed=2072, goal_proportion=0.03

(define (problem blocksworld-48)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 - object)
 (:init 
    (arm-empty)
    (clear b20)
    (on b20 b132)
    (on b132 b261)
    (on b261 b5)
    (on-table b5)
    (clear b21)
    (on b21 b205)
    (on b205 b232)
    (on b232 b69)
    (on-table b69)
    (clear b57)
    (on b57 b95)
    (on b95 b175)
    (on b175 b207)
    (on b207 b104)
    (on-table b104)
    (clear b101)
    (on b101 b193)
    (on b193 b65)
    (on-table b65)
    (clear b250)
    (on-table b250)
    (clear b81)
    (on b81 b247)
    (on b247 b194)
    (on b194 b140)
    (on b140 b25)
    (on b25 b176)
    (on-table b176)
    (clear b114)
    (on-table b114)
    (clear b206)
    (on b206 b29)
    (on b29 b70)
    (on b70 b112)
    (on-table b112)
    (clear b59)
    (on-table b59)
    (clear b40)
    (on b40 b53)
    (on b53 b212)
    (on b212 b135)
    (on b135 b203)
    (on b203 b248)
    (on b248 b92)
    (on b92 b71)
    (on-table b71)
    (clear b26)
    (on-table b26)
    (clear b37)
    (on b37 b233)
    (on b233 b258)
    (on b258 b120)
    (on-table b120)
    (clear b49)
    (on b49 b227)
    (on b227 b260)
    (on b260 b174)
    (on b174 b144)
    (on b144 b80)
    (on b80 b22)
    (on b22 b228)
    (on b228 b23)
    (on b23 b255)
    (on-table b255)
    (clear b183)
    (on b183 b159)
    (on b159 b136)
    (on b136 b72)
    (on b72 b168)
    (on b168 b186)
    (on b186 b178)
    (on-table b178)
    (clear b221)
    (on b221 b6)
    (on-table b6)
    (clear b226)
    (on b226 b146)
    (on b146 b170)
    (on b170 b157)
    (on b157 b66)
    (on b66 b171)
    (on b171 b1)
    (on-table b1)
    (clear b147)
    (on b147 b96)
    (on b96 b237)
    (on b237 b35)
    (on b35 b192)
    (on b192 b75)
    (on b75 b109)
    (on b109 b129)
    (on b129 b219)
    (on b219 b103)
    (on b103 b4)
    (on b4 b47)
    (on b47 b15)
    (on-table b15)
    (clear b213)
    (on b213 b149)
    (on b149 b134)
    (on b134 b209)
    (on b209 b36)
    (on-table b36)
    (clear b229)
    (on-table b229)
    (clear b55)
    (on b55 b251)
    (on b251 b141)
    (on-table b141)
    (clear b130)
    (on b130 b154)
    (on-table b154)
    (clear b11)
    (on b11 b245)
    (on b245 b34)
    (on b34 b113)
    (on-table b113)
    (clear b200)
    (on-table b200)
    (clear b150)
    (on b150 b196)
    (on b196 b210)
    (on b210 b118)
    (on b118 b138)
    (on b138 b88)
    (on b88 b199)
    (on-table b199)
    (clear b45)
    (on b45 b185)
    (on-table b185)
    (clear b100)
    (on b100 b84)
    (on-table b84)
    (clear b68)
    (on b68 b44)
    (on b44 b32)
    (on-table b32)
    (clear b208)
    (on b208 b131)
    (on b131 b143)
    (on b143 b28)
    (on-table b28)
    (clear b127)
    (on b127 b107)
    (on b107 b117)
    (on b117 b234)
    (on-table b234)
    (clear b46)
    (on b46 b38)
    (on b38 b12)
    (on b12 b3)
    (on b3 b61)
    (on-table b61)
    (clear b215)
    (on b215 b156)
    (on b156 b235)
    (on b235 b256)
    (on b256 b67)
    (on-table b67)
    (clear b10)
    (on b10 b119)
    (on b119 b19)
    (on b19 b98)
    (on b98 b239)
    (on b239 b122)
    (on b122 b189)
    (on b189 b42)
    (on b42 b56)
    (on-table b56)
    (clear b106)
    (on-table b106)
    (clear b184)
    (on b184 b121)
    (on-table b121)
    (clear b155)
    (on b155 b82)
    (on b82 b93)
    (on-table b93)
    (clear b58)
    (on b58 b173)
    (on b173 b214)
    (on b214 b217)
    (on-table b217)
    (clear b125)
    (on b125 b164)
    (on b164 b99)
    (on b99 b62)
    (on-table b62)
    (clear b30)
    (on b30 b86)
    (on-table b86)
    (clear b108)
    (on b108 b76)
    (on b76 b166)
    (on b166 b128)
    (on b128 b18)
    (on b18 b216)
    (on b216 b264)
    (on b264 b191)
    (on b191 b64)
    (on b64 b151)
    (on-table b151)
    (clear b188)
    (on-table b188)
    (clear b133)
    (on-table b133)
    (clear b243)
    (on-table b243)
    (clear b160)
    (on b160 b2)
    (on b2 b201)
    (on b201 b111)
    (on-table b111)
    (clear b73)
    (on b73 b187)
    (on-table b187)
    (clear b8)
    (on b8 b180)
    (on-table b180)
    (clear b195)
    (on b195 b13)
    (on-table b13)
    (clear b259)
    (on-table b259)
    (clear b142)
    (on-table b142)
    (clear b253)
    (on b253 b89)
    (on b89 b158)
    (on b158 b257)
    (on b257 b148)
    (on-table b148)
    (clear b182)
    (on b182 b252)
    (on-table b252)
    (clear b39)
    (on b39 b102)
    (on b102 b7)
    (on-table b7)
    (clear b263)
    (on b263 b223)
    (on b223 b43)
    (on b43 b24)
    (on b24 b48)
    (on b48 b41)
    (on b41 b17)
    (on b17 b161)
    (on b161 b74)
    (on b74 b27)
    (on b27 b116)
    (on b116 b14)
    (on b14 b153)
    (on b153 b202)
    (on b202 b50)
    (on b50 b169)
    (on-table b169)
    (clear b79)
    (on b79 b16)
    (on-table b16)
    (clear b236)
    (on b236 b33)
    (on b33 b77)
    (on b77 b105)
    (on-table b105)
    (clear b63)
    (on b63 b181)
    (on b181 b165)
    (on b165 b85)
    (on b85 b52)
    (on b52 b152)
    (on-table b152)
    (clear b123)
    (on b123 b31)
    (on b31 b246)
    (on b246 b242)
    (on b242 b231)
    (on b231 b172)
    (on b172 b124)
    (on b124 b211)
    (on-table b211)
    (clear b162)
    (on-table b162)
    (clear b90)
    (on b90 b9)
    (on b9 b218)
    (on-table b218)
    (clear b230)
    (on b230 b97)
    (on b97 b190)
    (on-table b190)
    (clear b139)
    (on b139 b249)
    (on b249 b179)
    (on b179 b262)
    (on b262 b78)
    (on b78 b91)
    (on b91 b60)
    (on b60 b94)
    (on b94 b225)
    (on b225 b163)
    (on-table b163)
    (clear b254)
    (on-table b254)
    (clear b83)
    (on b83 b204)
    (on b204 b220)
    (on b220 b145)
    (on b145 b87)
    (on b87 b222)
    (on-table b222)
    (clear b54)
    (on b54 b51)
    (on b51 b126)
    (on b126 b238)
    (on b238 b110)
    (on b110 b167)
    (on-table b167)
    (clear b240)
    (on b240 b241)
    (on b241 b198)
    (on-table b198)
    (clear b244)
    (on b244 b137)
    (on b137 b224)
    (on b224 b197)
    (on b197 b115)
    (on b115 b177)
    (on-table b177))
 (:goal  (and 
    (clear b2)
    (on b2 b5)
    (on b5 b1)
    (on-table b1)
    (clear b3)
    (on b3 b7)
    (on b7 b4)
    (on b4 b6)
    (on-table b6))))

; plan
1. (unstack b147 b96)
   deleted: (on b147 b96) (clear b147) (arm-empty)
   added: (holding b147) (clear b96)
   goals met: 2 of 9
2. (putdown b147)
   deleted: (holding b147)
   added: (clear b147) (arm-empty) (on-table b147)
   goals met: 2 of 9
3. (unstack b160 b2)
   deleted: (on b160 b2) (clear b160) (arm-empty)
   added: (holding b160) (clear b2)
   goals met: 3 of 9
4. (putdown b160)
   deleted: (holding b160)
   added: (clear b160) (arm-empty) (on-table b160)
   goals met: 3 of 9
5. (unstack b20 b132)
   deleted: (on b20 b132) (clear b20) (arm-empty)
   added: (holding b20) (clear b132)
   goals met: 3 of 9
6. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 3 of 9
7. (unstack b132 b261)
   deleted: (on b132 b261) (clear b132) (arm-empty)
   added: (holding b132) (clear b261)
   goals met: 3 of 9
8. (putdown b132)
   deleted: (holding b132)
   added: (clear b132) (arm-empty) (on-table b132)
   goals met: 3 of 9
9. (unstack b221 b6)
   deleted: (on b221 b6) (clear b221) (arm-empty)
   added: (holding b221) (clear b6)
   goals met: 3 of 9
10. (putdown b221)
   deleted: (holding b221)
   added: (clear b221) (arm-empty) (on-table b221)
   goals met: 3 of 9
11. (unstack b226 b146)
   deleted: (on b226 b146) (clear b226) (arm-empty)
   added: (holding b226) (clear b146)
   goals met: 3 of 9
12. (putdown b226)
   deleted: (holding b226)
   added: (clear b226) (arm-empty) (on-table b226)
   goals met: 3 of 9
13. (unstack b146 b170)
   deleted: (on b146 b170) (clear b146) (arm-empty)
   added: (holding b146) (clear b170)
   goals met: 3 of 9
14. (putdown b146)
   deleted: (holding b146)
   added: (clear b146) (arm-empty) (on-table b146)
   goals met: 3 of 9
15. (unstack b170 b157)
   deleted: (on b170 b157) (clear b170) (arm-empty)
   added: (holding b170) (clear b157)
   goals met: 3 of 9
16. (putdown b170)
   deleted: (holding b170)
   added: (clear b170) (arm-empty) (on-table b170)
   goals met: 3 of 9
17. (unstack b157 b66)
   deleted: (on b157 b66) (clear b157) (arm-empty)
   added: (holding b157) (clear b66)
   goals met: 3 of 9
18. (putdown b157)
   deleted: (holding b157)
   added: (clear b157) (arm-empty) (on-table b157)
   goals met: 3 of 9
19. (unstack b261 b5)
   deleted: (on b261 b5) (clear b261) (arm-empty)
   added: (holding b261) (clear b5)
   goals met: 3 of 9
20. (putdown b261)
   deleted: (holding b261)
   added: (clear b261) (arm-empty) (on-table b261)
   goals met: 3 of 9
21. (unstack b39 b102)
   deleted: (on b39 b102) (clear b39) (arm-empty)
   added: (holding b39) (clear b102)
   goals met: 3 of 9
22. (putdown b39)
   deleted: (holding b39)
   added: (clear b39) (arm-empty) (on-table b39)
   goals met: 3 of 9
23. (unstack b102 b7)
   deleted: (on b102 b7) (clear b102) (arm-empty)
   added: (holding b102) (clear b7)
   goals met: 3 of 9
24. (putdown b102)
   deleted: (holding b102)
   added: (clear b102) (arm-empty) (on-table b102)
   goals met: 3 of 9
25. (unstack b46 b38)
   deleted: (on b46 b38) (clear b46) (arm-empty)
   added: (holding b46) (clear b38)
   goals met: 3 of 9
26. (putdown b46)
   deleted: (holding b46)
   added: (clear b46) (arm-empty) (on-table b46)
   goals met: 3 of 9
27. (unstack b38 b12)
   deleted: (on b38 b12) (clear b38) (arm-empty)
   added: (holding b38) (clear b12)
   goals met: 3 of 9
28. (putdown b38)
   deleted: (holding b38)
   added: (clear b38) (arm-empty) (on-table b38)
   goals met: 3 of 9
29. (unstack b12 b3)
   deleted: (on b12 b3) (clear b12) (arm-empty)
   added: (holding b12) (clear b3)
   goals met: 4 of 9
30. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 4 of 9
31. (unstack b66 b171)
   deleted: (on b66 b171) (clear b66) (arm-empty)
   added: (holding b66) (clear b171)
   goals met: 4 of 9
32. (putdown b66)
   deleted: (holding b66)
   added: (clear b66) (arm-empty) (on-table b66)
   goals met: 4 of 9
33. (unstack b171 b1)
   deleted: (on b171 b1) (clear b171) (arm-empty)
   added: (holding b171) (clear b1)
   goals met: 4 of 9
34. (putdown b171)
   deleted: (holding b171)
   added: (clear b171) (arm-empty) (on-table b171)
   goals met: 4 of 9
35. (unstack b96 b237)
   deleted: (on b96 b237) (clear b96) (arm-empty)
   added: (holding b96) (clear b237)
   goals met: 4 of 9
36. (putdown b96)
   deleted: (holding b96)
   added: (clear b96) (arm-empty) (on-table b96)
   goals met: 4 of 9
37. (unstack b237 b35)
   deleted: (on b237 b35) (clear b237) (arm-empty)
   added: (holding b237) (clear b35)
   goals met: 4 of 9
38. (putdown b237)
   deleted: (holding b237)
   added: (clear b237) (arm-empty) (on-table b237)
   goals met: 4 of 9
39. (unstack b35 b192)
   deleted: (on b35 b192) (clear b35) (arm-empty)
   added: (holding b35) (clear b192)
   goals met: 4 of 9
40. (putdown b35)
   deleted: (holding b35)
   added: (clear b35) (arm-empty) (on-table b35)
   goals met: 4 of 9
41. (unstack b192 b75)
   deleted: (on b192 b75) (clear b192) (arm-empty)
   added: (holding b192) (clear b75)
   goals met: 4 of 9
42. (putdown b192)
   deleted: (holding b192)
   added: (clear b192) (arm-empty) (on-table b192)
   goals met: 4 of 9
43. (unstack b75 b109)
   deleted: (on b75 b109) (clear b75) (arm-empty)
   added: (holding b75) (clear b109)
   goals met: 4 of 9
44. (putdown b75)
   deleted: (holding b75)
   added: (clear b75) (arm-empty) (on-table b75)
   goals met: 4 of 9
45. (unstack b109 b129)
   deleted: (on b109 b129) (clear b109) (arm-empty)
   added: (holding b109) (clear b129)
   goals met: 4 of 9
46. (putdown b109)
   deleted: (holding b109)
   added: (clear b109) (arm-empty) (on-table b109)
   goals met: 4 of 9
47. (unstack b129 b219)
   deleted: (on b129 b219) (clear b129) (arm-empty)
   added: (holding b129) (clear b219)
   goals met: 4 of 9
48. (putdown b129)
   deleted: (holding b129)
   added: (clear b129) (arm-empty) (on-table b129)
   goals met: 4 of 9
49. (unstack b219 b103)
   deleted: (on b219 b103) (clear b219) (arm-empty)
   added: (holding b219) (clear b103)
   goals met: 4 of 9
50. (putdown b219)
   deleted: (holding b219)
   added: (clear b219) (arm-empty) (on-table b219)
   goals met: 4 of 9
51. (unstack b103 b4)
   deleted: (on b103 b4) (clear b103) (arm-empty)
   added: (holding b103) (clear b4)
   goals met: 4 of 9
52. (putdown b103)
   deleted: (holding b103)
   added: (clear b103) (arm-empty) (on-table b103)
   goals met: 4 of 9
53. (unstack b4 b47)
   deleted: (on b4 b47) (clear b4) (arm-empty)
   added: (holding b4) (clear b47)
   goals met: 4 of 9
54. (stack b4 b6)
   deleted: (clear b6) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b6)
   goals met: 5 of 9
55. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 5 of 9
56. (stack b5 b1)
   deleted: (clear b1) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b1)
   goals met: 6 of 9
57. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 6 of 9
58. (stack b7 b4)
   deleted: (clear b4) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b4)
   goals met: 7 of 9
59. (unstack b2 b201)
   deleted: (on b2 b201) (clear b2) (arm-empty)
   added: (holding b2) (clear b201)
   goals met: 6 of 9
60. (stack b2 b5)
   deleted: (clear b5) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b5)
   goals met: 8 of 9
61. (unstack b3 b61)
   deleted: (on b3 b61) (clear b3) (arm-empty)
   added: (holding b3) (clear b61)
   goals met: 7 of 9
62. (stack b3 b7)
   deleted: (clear b7) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b7)
   goals met: 9 of 9
